In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('max_columns',50)
%matplotlib inline

In [4]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])

In [5]:
s

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object

In [8]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],index = ['A','B','C','D','E'])

In [9]:
s

A                7
B       Heisenberg
C             3.14
D      -1789710578
E    Happy Eating!
dtype: object

In [10]:
s['A']

7

In [14]:
d= {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)

In [16]:
cities['Boston']

nan

In [22]:
ins = ['Chicago','Portland','San Francisco']
cities[ins]
cities[cities<1000]
less_than_1000 = cities < 1000
less_than_1000.value_counts()

False    4
True     2
dtype: int64

In [25]:
cities['Chicago'] = 1200
print(cities)
print (cities)

Austin            450
Boston            NaN
Chicago          1200
New York         1300
Portland          900
San Francisco    1100
dtype: float64
Austin            450
Boston            NaN
Chicago          1200
New York         1300
Portland          900
San Francisco    1100
dtype: float64

In [27]:
print ('Seattle' in cities)

False

In [30]:
print(cities[['Chicago','San Francisco']])

Chicago          1200
San Francisco    1100
dtype: float64

In [31]:
print(cities[['Chicago', 'New York', 'Portland']] + cities[['Austin', 'New York']])

Austin       NaN
Chicago      NaN
New York    2600
Portland     NaN
dtype: float64

In [32]:
print(cities.isnull())

Austin           False
Boston            True
Chicago          False
New York         False
Portland         False
San Francisco    False
dtype: bool

In [33]:
cities.isnull().value_counts()

False    5
True     1
dtype: int64

In [39]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data,columns=['year','team','wins','losses'])
print(football)

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [40]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [44]:
!head -n 5 mariano-rivera.csv

'head' is not recognized as an internal or external command,
operable program or batch file.

In [2]:
%cd C:/Users/Xiuhong/Desktop/csv files

C:\Users\Xiuhong\Desktop\csv files

In [45]:
from_csv = pd.read_csv('mariano-rivera.csv')
from_csv.head()

,Year,Age,Tm,Lg,W,L,W-L%,ERA,G,GS,GF,CG,SHO,SV,IP,H,R,ER,HR,BB,IBB,SO,HBP,BK,WP,BF,ERA+,WHIP,H/9,HR/9,BB/9,SO/9,SO/BB,Awards
0,1995,25,NYY,AL,5,3,0.625,5.51,19,10,2,0,0,0,67.0,71,43,41,11,30,0,51,2,1,0,301,84,1.507,9.5,1.5,4.0,6.9,1.70,NaN
1,1996,26,NYY,AL,8,3,0.727,2.09,61,0,14,0,0,5,107.2,73,25,25,1,34,3,130,2,0,1,425,240,0.994,6.1,0.1,2.8,10.9,3.82,CYA-3MVP-12
2,1997,27,NYY,AL,6,4,0.600,1.88,66,0,56,0,0,43,71.2,65,17,15,5,20,6,68,0,0,2,301,239,1.186,8.2,0.6,2.5,8.5,3.40,ASMVP-25
3,1998,28,NYY,AL,3,0,1.000,1.91,54,0,49,0,0,36,61.1,48,13,13,3,17,1,36,1,0,0,246,233,1.060,7.0,0.4,2.5,5.3,2.12,NaN
4,1999,29,NYY,AL,4,3,0.571,1.83,66,0,63,0,0,45,69.0,43,15,14,2,18,3,52,3,1,2,268,257,0.884,5.6,0.3,2.3,6.8,2.89,ASCYA-3MVP-14

In [49]:
cols = ['num', 'game', 'date', 'team', 'home_away', 'opponent',
        'result', 'quarter', 'distance', 'receiver', 'score_before',
        'score_after']
no_headers = pd.read_csv('peyton-passing-TDs-2012.csv', sep=',', header=None,
                         names=cols)
no_headers.head()

,num,game,date,team,home_away,opponent,result,quarter,distance,receiver,score_before,score_after
0,1,1,2012-09-09,DEN,NaN,PIT,W 31-19,3,71,Demaryius Thomas,Trail 7-13,Lead 14-13*
1,2,1,2012-09-09,DEN,NaN,PIT,W 31-19,4,1,Jacob Tamme,Trail 14-19,Lead 22-19*
2,3,2,2012-09-17,DEN,@,ATL,L 21-27,2,17,Demaryius Thomas,Trail 0-20,Trail 7-20
3,4,3,2012-09-23,DEN,NaN,HOU,L 25-31,4,38,Brandon Stokley,Trail 11-31,Trail 18-31
4,5,3,2012-09-23,DEN,NaN,HOU,L 25-31,4,6,Joel Dreessen,Trail 18-31,Trail 25-31

In [50]:
with_headers = pd.read_csv('peyton-passing-TDs-2012.csv')
with_headers.head()

,1,1.1,2012-09-09,DEN,Unnamed: 4,PIT,W 31-19,3,71,Demaryius Thomas,Trail 7-13,Lead 14-13*
0,2,1,2012-09-09,DEN,NaN,PIT,W 31-19,4,1,Jacob Tamme,Trail 14-19,Lead 22-19*
1,3,2,2012-09-17,DEN,@,ATL,L 21-27,2,17,Demaryius Thomas,Trail 0-20,Trail 7-20
2,4,3,2012-09-23,DEN,NaN,HOU,L 25-31,4,38,Brandon Stokley,Trail 11-31,Trail 18-31
3,5,3,2012-09-23,DEN,NaN,HOU,L 25-31,4,6,Joel Dreessen,Trail 18-31,Trail 25-31
4,6,4,2012-09-30,DEN,NaN,OAK,W 37-6,1,22,Joel Dreessen,Tied 0-0,Lead 7-0*

In [53]:
no_headers.to_csv('C:/Users/Xiuhong/Desktop/test.csv')

In [54]:
football.to_excel('football.xlsx',index= False)

In [55]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [56]:
del football

In [59]:
football = pd.read_excel('football.xlsx', 'Sheet1')

In [60]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [61]:
hank = pd.read_clipboard()
hank.head()

,Year,Age,Tm,Lg,G,PA,AB,R,H,2B,3B,HR,RBI,SB,CS,BB,SO,BA,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB,Pos,Awards
0,1954,20,MLN,NL,122,509,468,58,131,27,6,13,69,2,2,28,39,0.280,0.322,0.447,0.769,104,209,13,3,6,4,NaN,*79,RoY-4
1,1955 ?,21,MLN,NL,153,665,602,105,189,37,9,27,106,3,1,49,61,0.314,0.366,0.540,0.906,141,325,20,3,7,4,5,*974,"AS,MVP-9"
2,1956 ?,22,MLN,NL,153,660,609,106,200,34,14,26,92,2,4,37,54,0.328,0.365,0.558,0.923,151,340,21,2,5,7,6,*9,"AS,MVP-3"
3,1957 ?,23,MLN,NL,151,675,615,118,198,27,6,44,132,1,1,57,58,0.322,0.378,0.600,0.978,166,369,13,0,0,3,15,*98,"AS,MVP-1"
4,1958 ?,24,MLN,NL,153,664,601,109,196,34,4,30,95,4,1,59,49,0.326,0.386,0.546,0.931,152,328,21,1,0,3,16,*98,"AS,MVP-3,GG"

In [66]:
sandwage = pd.read_clipboard()
sandwage.head()

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925
3,4,Roast Beef,Al&rsquo;s Deli,"The Francophile brothers behind this deli, whi...",$9.40.,914 Noyes St.,Evanston,NaN,alsdeli.net,"914 Noyes St., Evanston","914 Noyes Street, Evanston, IL 60201, USA",42.058442,-87.684425
4,5,PB&amp;L,Publican Qualty Meats,"When this place opened in February, it quickly...",$10,825 W. Fulton Mkt.,Chicago,312-445-8977,publicanqualitymeats.com,"825 W. Fulton Mkt., Chicago","825 West Fulton Market, Chicago, IL 60607, USA",41.886637,-87.648553

In [64]:
url = 'https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv'
from_url = pd.read_table(url,sep='\t')
from_url.head()

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925
3,4,Roast Beef,Al&rsquo;s Deli,"The Francophile brothers behind this deli, whi...",$9.40.,914 Noyes St.,Evanston,NaN,alsdeli.net,"914 Noyes St., Evanston","914 Noyes Street, Evanston, IL 60201, USA",42.058442,-87.684425
4,5,PB&amp;L,Publican Qualty Meats,"When this place opened in February, it quickly...",$10,825 W. Fulton Mkt.,Chicago,312-445-8977,publicanqualitymeats.com,"825 W. Fulton Mkt., Chicago","825 West Fulton Market, Chicago, IL 60607, USA",41.886637,-87.648553

In [67]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('ml-100k/u.user', sep='|', names=u_cols,
                    encoding='latin-1')

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('ml-100k/u.data', sep='\t', names=r_cols,
                      encoding='latin-1')

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('ml-100k/u.item', sep='|', names=m_cols, usecols=range(5),
                     encoding='latin-1')

In [68]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 78.8+ KB

In [69]:
print(users.iloc[[1,50,300]])

     user_id  age sex occupation zip_code
1          2   53   F      other    94043
50        51   28   M   educator    16509
300      301   24   M    student    55439

In [70]:
print(users.loc[[2,51,301]])

     user_id  age sex occupation zip_code
2          3   23   M     writer    32067
51        52   18   F    student    55105
301      302   42   M   educator    77904

In [71]:
users.set_index('user_id', inplace=True)
print(users.iloc[[1,50,300]])

         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

In [72]:
print(users.loc[[2,51,301]])

         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

In [73]:
users.reset_index(inplace=True)
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [74]:
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})
print(left_frame)
print('\n')
print(right_frame)

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [76]:
pd.concat([left_frame,right_frame])

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

In [77]:
pd.concat([left_frame,right_frame],axis=1)

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

In [3]:
headers = ['name', 'title', 'department', 'salary']
chicago = pd.read_csv('city-of-chicago-salaries.csv',header=0,names = headers, converters={'salary': lambda x: float(x.replace('$',''))})
chicago.head()

                    name                     title        department  salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT   85512
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE   75372
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES   80916
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT   99648
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION   89440

In [10]:
by_dept = chicago.groupby(['department'])

In [14]:
df1 = pd.DataFrame(np.random.randint(1, 5, (10,2)), columns=['a','b'])

df1.sort(['a', 'b'], ascending=[True, False])

C:\Users\Xiuhong\Anaconda2\envs\dato-env\lib\site-packages\ipykernel\__main__.py:3: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  app.launch_new_instance()

   a  b
5  1  4
0  1  2
6  2  2
7  3  4
1  3  2
2  3  2
8  3  1
9  3  1
3  4  3
4  4  3

In [17]:
df1_b=df1.groupby('b')
df1_b.head()

   a  b
0  1  2
1  3  2
2  3  2
3  4  3
4  4  3
5  1  4
6  2  2
7  3  4
8  3  1
9  3  1

In [18]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ...:                           'foo', 'bar', 'foo', 'foo'],
   ...:                    'B' : ['one', 'one', 'two', 'three',
   ...:                           'two', 'two', 'one', 'three'],
   ...:                    'C' : np.random.randn(8),
   ...:                    'D' : np.random.randn(8)})
   ...:

In [25]:
df.head()
grouped = df.groupby('A')
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [26]:
by_dept = chicago.groupby('department')
by_dept

In [32]:
by_dept.title.nunique().sort_values(ascending=False)[:5]
def ranker(df):
    """Assigns a rank to each employee based on salary, with 1 being the highest paid.
    Assumes the data is DESC sorted."""
    df['dept_rank']=np.arange(len(df))+1
    return df

In [33]:
chicago.sort_values('salary',ascending=False,inplace=True)
chicago=chicago.groupby('department').apply(ranker)
chicago[chicago.dept_rank==1].head()

,name,title,department,salary,dept_rank
18039,"MC CARTHY, GARRY F",SUPERINTENDENT OF POLICE,POLICE,260004,1
8004,"EMANUEL, RAHM",MAYOR,MAYOR'S OFFICE,216210,1
25588,"SANTIAGO, JOSE A",FIRE COMMISSIONER,FIRE,202728,1
763,"ANDOLINO, ROSEMARIE S",COMMISSIONER OF AVIATION,AVIATION,186576,1
4697,"CHOUCAIR, BECHARA N",COMMISSIONER OF HEALTH,HEALTH,177156,1

In [34]:
print(np.arange(10))

[0 1 2 3 4 5 6 7 8 9]

In [37]:
print(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [38]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('ml-100k/u.user', sep='|', names=u_cols,
                    encoding='latin-1')

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('ml-100k/u.data', sep='\t', names=r_cols,
                      encoding='latin-1')

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('ml-100k/u.item', sep='|', names=m_cols, usecols=range(5),
                     encoding='latin-1')

# create one merged DataFrame
movie_ratings = pd.merge(movies, ratings)
lens = pd.merge(movie_ratings, users)

In [63]:
lens.groupby('title').agg({'rating':[np.size,np.mean]}).sort_values([('rating', 'size'),('rating','mean')], ascending=[False,False]).head()

                          rating
                            size      mean
title
Star Wars (1977)             583  4.358491
Contact (1997)               509  3.803536
Fargo (1996)                 508  4.155512
Return of the Jedi (1983)    507  4.007890
Liar Liar (1997)             485  3.156701

In [65]:
movie_stats = lens.groupby('title').agg({'rating': [np.size, np.mean]})

In [67]:
at_least_100 = movie_stats[movie_stats['rating']['size']>=100]

In [69]:
at_least_100['rating']['mean'].sort_values(ascending=False)[:15]

title
Close Shave, A (1995)                     4.491071
Schindler's List (1993)                   4.466443
Wrong Trousers, The (1993)                4.466102
Casablanca (1942)                         4.456790
Shawshank Redemption, The (1994)          4.445230
Rear Window (1954)                        4.387560
Usual Suspects, The (1995)                4.385768
Star Wars (1977)                          4.358491
12 Angry Men (1957)                       4.344000
Citizen Kane (1941)                       4.292929
To Kill a Mockingbird (1962)              4.292237
One Flew Over the Cuckoo's Nest (1975)    4.291667
Silence of the Lambs, The (1991)          4.289744
North by Northwest (1959)                 4.284916
Godfather, The (1972)                     4.283293
Name: mean, dtype: float64

In [71]:
most_50_test= lens.movie_id.value_counts()[:50]

In [73]:
most_50 = lens.groupby('movie_id').size().sort_values(ascending=False)[:50]

In [74]:
most_50_test

50     583
258    509
100    508
181    507
294    485
286    481
288    478
1      452
300    431
121    429
174    420
127    413
56     394
7      392
98     390
237    384
117    378
172    367
222    365
313    350
204    350
405    344
79     336
210    331
151    326
173    324
69     321
748    316
168    316
269    315
257    303
195    301
423    300
9      299
318    298
276    298
302    297
22     297
328    295
96     295
118    293
25     293
15     293
183    291
216    290
176    284
64     283
202    280
234    280
28     276
Name: movie_id, dtype: int64

In [75]:
most_50

movie_id
50     583
258    509
100    508
181    507
294    485
286    481
288    478
1      452
300    431
121    429
174    420
127    413
56     394
7      392
98     390
237    384
117    378
172    367
222    365
313    350
204    350
405    344
79     336
210    331
151    326
173    324
69     321
168    316
748    316
269    315
257    303
195    301
423    300
9      299
318    298
276    298
302    297
22     297
96     295
328    295
25     293
15     293
118    293
183    291
216    290
176    284
64     283
234    280
202    280
28     276
dtype: int64

In [78]:
labels = ['0-9', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79']
lens['age_group']=pd.cut(lens.age,range(0,81,10),right=False,labels=labels)
lens[['age','age_group']].drop_duplicates()[:10]

      age age_group
0      60     60-69
397    21     20-29
459    33     30-39
524    30     30-39
782    23     20-29
995    29     20-29
1229   26     20-29
1664   31     30-39
1942   24     20-29
2270   32     30-39

In [80]:
lens.groupby('age_group').agg({'rating':[np.size,np.mean]})

          rating
            size      mean
age_group
0-9           43  3.767442
10-19       8181  3.486126
20-29      39535  3.467333
30-39      25696  3.554444
40-49      15021  3.591772
50-59       8704  3.635800
60-69       2623  3.648875
70-79        197  3.649746